grevaillot/svd_tools/headers/STM32L4x1/dfsdm.h
/** @defgroup dfsdm_chcfg0r1 CHCFG0R1 channel configuration y register
@{*/

/** DFSDM_CHCFG0R1_DFSDMEN DFSDMEN **/
#define DFSDM_CHCFG0R1_DFSDMEN		(1 << 31)
/** DFSDM_CHCFG0R1_CKOUTSRC CKOUTSRC **/
#define DFSDM_CHCFG0R1_CKOUTSRC		(1 << 30)

#define DFSDM_CHCFG0R1_CKOUTDIV_SHIFT		16
#define DFSDM_CHCFG0R1_CKOUTDIV_MASK		0xff
/** @defgroup dfsdm_chcfg0r1_ckoutdiv CKOUTDIV CKOUTDIV
@{*/
/**@}*/


#define DFSDM_CHCFG0R1_DATPACK_SHIFT		14
#define DFSDM_CHCFG0R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_chcfg0r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CHCFG0R1_DATMPX_SHIFT		12
#define DFSDM_CHCFG0R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_chcfg0r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CHCFG0R1_CHINSEL CHINSEL **/
#define DFSDM_CHCFG0R1_CHINSEL		(1 << 8)
/** DFSDM_CHCFG0R1_CHEN CHEN **/
#define DFSDM_CHCFG0R1_CHEN		(1 << 7)
/** DFSDM_CHCFG0R1_CKABEN CKABEN **/
#define DFSDM_CHCFG0R1_CKABEN		(1 << 6)
/** DFSDM_CHCFG0R1_SCDEN SCDEN **/
#define DFSDM_CHCFG0R1_SCDEN		(1 << 5)

#define DFSDM_CHCFG0R1_SPICKSEL_SHIFT		2
#define DFSDM_CHCFG0R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_chcfg0r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CHCFG0R1_SITP_SHIFT		0
#define DFSDM_CHCFG0R1_SITP_MASK		0x03
/** @defgroup dfsdm_chcfg0r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg0r2 CHCFG0R2 channel configuration y register
@{*/


#define DFSDM_CHCFG0R2_OFFSET_SHIFT		8
#define DFSDM_CHCFG0R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_chcfg0r2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CHCFG0R2_DTRBS_SHIFT		3
#define DFSDM_CHCFG0R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_chcfg0r2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_awscd0r AWSCD0R analog watchdog and short-circuit detector register
@{*/


#define DFSDM_AWSCD0R_AWFORD_SHIFT		22
#define DFSDM_AWSCD0R_AWFORD_MASK		0x03
/** @defgroup dfsdm_awscd0r_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_AWSCD0R_AWFOSR_SHIFT		16
#define DFSDM_AWSCD0R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_awscd0r_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_AWSCD0R_BKSCD_SHIFT		12
#define DFSDM_AWSCD0R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_awscd0r_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_AWSCD0R_SCDT_SHIFT		0
#define DFSDM_AWSCD0R_SCDT_MASK		0xff
/** @defgroup dfsdm_awscd0r_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chwdat0r CHWDAT0R channel watchdog filter data register
@{*/


#define DFSDM_CHWDAT0R_WDATA_SHIFT		0
#define DFSDM_CHWDAT0R_WDATA_MASK		0xffff
/** @defgroup dfsdm_chwdat0r_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chdatin0r CHDATIN0R channel data input register
@{*/


#define DFSDM_CHDATIN0R_INDAT1_SHIFT		16
#define DFSDM_CHDATIN0R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_chdatin0r_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CHDATIN0R_INDAT0_SHIFT		0
#define DFSDM_CHDATIN0R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_chdatin0r_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg1r1 CHCFG1R1 CHCFG1R1
@{*/


#define DFSDM_CHCFG1R1_DATPACK_SHIFT		14
#define DFSDM_CHCFG1R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_chcfg1r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CHCFG1R1_DATMPX_SHIFT		12
#define DFSDM_CHCFG1R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_chcfg1r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CHCFG1R1_CHINSEL CHINSEL **/
#define DFSDM_CHCFG1R1_CHINSEL		(1 << 8)
/** DFSDM_CHCFG1R1_CHEN CHEN **/
#define DFSDM_CHCFG1R1_CHEN		(1 << 7)
/** DFSDM_CHCFG1R1_CKABEN CKABEN **/
#define DFSDM_CHCFG1R1_CKABEN		(1 << 6)
/** DFSDM_CHCFG1R1_SCDEN SCDEN **/
#define DFSDM_CHCFG1R1_SCDEN		(1 << 5)

#define DFSDM_CHCFG1R1_SPICKSEL_SHIFT		2
#define DFSDM_CHCFG1R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_chcfg1r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CHCFG1R1_SITP_SHIFT		0
#define DFSDM_CHCFG1R1_SITP_MASK		0x03
/** @defgroup dfsdm_chcfg1r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg1r2 CHCFG1R2 CHCFG1R2
@{*/


#define DFSDM_CHCFG1R2_OFFSET_SHIFT		8
#define DFSDM_CHCFG1R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_chcfg1r2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CHCFG1R2_DTRBS_SHIFT		3
#define DFSDM_CHCFG1R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_chcfg1r2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_awscd1r AWSCD1R AWSCD1R
@{*/


#define DFSDM_AWSCD1R_AWFORD_SHIFT		22
#define DFSDM_AWSCD1R_AWFORD_MASK		0x03
/** @defgroup dfsdm_awscd1r_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_AWSCD1R_AWFOSR_SHIFT		16
#define DFSDM_AWSCD1R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_awscd1r_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_AWSCD1R_BKSCD_SHIFT		12
#define DFSDM_AWSCD1R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_awscd1r_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_AWSCD1R_SCDT_SHIFT		0
#define DFSDM_AWSCD1R_SCDT_MASK		0xff
/** @defgroup dfsdm_awscd1r_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chwdat1r CHWDAT1R CHWDAT1R
@{*/


#define DFSDM_CHWDAT1R_WDATA_SHIFT		0
#define DFSDM_CHWDAT1R_WDATA_MASK		0xffff
/** @defgroup dfsdm_chwdat1r_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chdatin1r CHDATIN1R CHDATIN1R
@{*/


#define DFSDM_CHDATIN1R_INDAT1_SHIFT		16
#define DFSDM_CHDATIN1R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_chdatin1r_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CHDATIN1R_INDAT0_SHIFT		0
#define DFSDM_CHDATIN1R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_chdatin1r_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg2r1 CHCFG2R1 CHCFG2R1
@{*/


#define DFSDM_CHCFG2R1_DATPACK_SHIFT		14
#define DFSDM_CHCFG2R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_chcfg2r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CHCFG2R1_DATMPX_SHIFT		12
#define DFSDM_CHCFG2R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_chcfg2r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CHCFG2R1_CHINSEL CHINSEL **/
#define DFSDM_CHCFG2R1_CHINSEL		(1 << 8)
/** DFSDM_CHCFG2R1_CHEN CHEN **/
#define DFSDM_CHCFG2R1_CHEN		(1 << 7)
/** DFSDM_CHCFG2R1_CKABEN CKABEN **/
#define DFSDM_CHCFG2R1_CKABEN		(1 << 6)
/** DFSDM_CHCFG2R1_SCDEN SCDEN **/
#define DFSDM_CHCFG2R1_SCDEN		(1 << 5)

