grevaillot/svd_tools/headers/STM32L4x1/dfsdm.h
#define DFSDM_CHCFG2R1_SPICKSEL_SHIFT		2
#define DFSDM_CHCFG2R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_chcfg2r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CHCFG2R1_SITP_SHIFT		0
#define DFSDM_CHCFG2R1_SITP_MASK		0x03
/** @defgroup dfsdm_chcfg2r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg2r2 CHCFG2R2 CHCFG2R2
@{*/


#define DFSDM_CHCFG2R2_OFFSET_SHIFT		8
#define DFSDM_CHCFG2R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_chcfg2r2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CHCFG2R2_DTRBS_SHIFT		3
#define DFSDM_CHCFG2R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_chcfg2r2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_awscd2r AWSCD2R AWSCD2R
@{*/


#define DFSDM_AWSCD2R_AWFORD_SHIFT		22
#define DFSDM_AWSCD2R_AWFORD_MASK		0x03
/** @defgroup dfsdm_awscd2r_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_AWSCD2R_AWFOSR_SHIFT		16
#define DFSDM_AWSCD2R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_awscd2r_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_AWSCD2R_BKSCD_SHIFT		12
#define DFSDM_AWSCD2R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_awscd2r_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_AWSCD2R_SCDT_SHIFT		0
#define DFSDM_AWSCD2R_SCDT_MASK		0xff
/** @defgroup dfsdm_awscd2r_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chwdat2r CHWDAT2R CHWDAT2R
@{*/


#define DFSDM_CHWDAT2R_WDATA_SHIFT		0
#define DFSDM_CHWDAT2R_WDATA_MASK		0xffff
/** @defgroup dfsdm_chwdat2r_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chdatin2r CHDATIN2R CHDATIN2R
@{*/


#define DFSDM_CHDATIN2R_INDAT1_SHIFT		16
#define DFSDM_CHDATIN2R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_chdatin2r_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CHDATIN2R_INDAT0_SHIFT		0
#define DFSDM_CHDATIN2R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_chdatin2r_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg3r1 CHCFG3R1 CHCFG3R1
@{*/


#define DFSDM_CHCFG3R1_DATPACK_SHIFT		14
#define DFSDM_CHCFG3R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_chcfg3r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CHCFG3R1_DATMPX_SHIFT		12
#define DFSDM_CHCFG3R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_chcfg3r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CHCFG3R1_CHINSEL CHINSEL **/
#define DFSDM_CHCFG3R1_CHINSEL		(1 << 8)
/** DFSDM_CHCFG3R1_CHEN CHEN **/
#define DFSDM_CHCFG3R1_CHEN		(1 << 7)
/** DFSDM_CHCFG3R1_CKABEN CKABEN **/
#define DFSDM_CHCFG3R1_CKABEN		(1 << 6)
/** DFSDM_CHCFG3R1_SCDEN SCDEN **/
#define DFSDM_CHCFG3R1_SCDEN		(1 << 5)

#define DFSDM_CHCFG3R1_SPICKSEL_SHIFT		2
#define DFSDM_CHCFG3R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_chcfg3r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CHCFG3R1_SITP_SHIFT		0
#define DFSDM_CHCFG3R1_SITP_MASK		0x03
/** @defgroup dfsdm_chcfg3r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg3r2 CHCFG3R2 CHCFG3R2
@{*/


#define DFSDM_CHCFG3R2_OFFSET_SHIFT		8
#define DFSDM_CHCFG3R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_chcfg3r2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CHCFG3R2_DTRBS_SHIFT		3
#define DFSDM_CHCFG3R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_chcfg3r2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_awscd3r AWSCD3R AWSCD3R
@{*/


#define DFSDM_AWSCD3R_AWFORD_SHIFT		22
#define DFSDM_AWSCD3R_AWFORD_MASK		0x03
/** @defgroup dfsdm_awscd3r_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_AWSCD3R_AWFOSR_SHIFT		16
#define DFSDM_AWSCD3R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_awscd3r_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_AWSCD3R_BKSCD_SHIFT		12
#define DFSDM_AWSCD3R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_awscd3r_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_AWSCD3R_SCDT_SHIFT		0
#define DFSDM_AWSCD3R_SCDT_MASK		0xff
/** @defgroup dfsdm_awscd3r_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chwdat3r CHWDAT3R CHWDAT3R
@{*/


#define DFSDM_CHWDAT3R_WDATA_SHIFT		0
#define DFSDM_CHWDAT3R_WDATA_MASK		0xffff
/** @defgroup dfsdm_chwdat3r_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chdatin3r CHDATIN3R CHDATIN3R
@{*/


#define DFSDM_CHDATIN3R_INDAT1_SHIFT		16
#define DFSDM_CHDATIN3R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_chdatin3r_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CHDATIN3R_INDAT0_SHIFT		0
#define DFSDM_CHDATIN3R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_chdatin3r_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg4r1 CHCFG4R1 CHCFG4R1
@{*/


#define DFSDM_CHCFG4R1_DATPACK_SHIFT		14
#define DFSDM_CHCFG4R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_chcfg4r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CHCFG4R1_DATMPX_SHIFT		12
#define DFSDM_CHCFG4R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_chcfg4r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CHCFG4R1_CHINSEL CHINSEL **/
#define DFSDM_CHCFG4R1_CHINSEL		(1 << 8)
/** DFSDM_CHCFG4R1_CHEN CHEN **/
#define DFSDM_CHCFG4R1_CHEN		(1 << 7)
/** DFSDM_CHCFG4R1_CKABEN CKABEN **/
#define DFSDM_CHCFG4R1_CKABEN		(1 << 6)
/** DFSDM_CHCFG4R1_SCDEN SCDEN **/
#define DFSDM_CHCFG4R1_SCDEN		(1 << 5)

#define DFSDM_CHCFG4R1_SPICKSEL_SHIFT		2
#define DFSDM_CHCFG4R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_chcfg4r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CHCFG4R1_SITP_SHIFT		0
#define DFSDM_CHCFG4R1_SITP_MASK		0x03
/** @defgroup dfsdm_chcfg4r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg4r2 CHCFG4R2 CHCFG4R2
@{*/


#define DFSDM_CHCFG4R2_OFFSET_SHIFT		8
#define DFSDM_CHCFG4R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_chcfg4r2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CHCFG4R2_DTRBS_SHIFT		3
#define DFSDM_CHCFG4R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_chcfg4r2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_awscd4r AWSCD4R AWSCD4R
@{*/


#define DFSDM_AWSCD4R_AWFORD_SHIFT		22
#define DFSDM_AWSCD4R_AWFORD_MASK		0x03
/** @defgroup dfsdm_awscd4r_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_AWSCD4R_AWFOSR_SHIFT		16
#define DFSDM_AWSCD4R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_awscd4r_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_AWSCD4R_BKSCD_SHIFT		12
#define DFSDM_AWSCD4R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_awscd4r_bkscd BKSCD BKSCD
@{*/
/**@}*/


