grevaillot/svd_tools/headers/STM32L4x1/dfsdm.h
#define DFSDM_AWSCD4R_SCDT_SHIFT		0
#define DFSDM_AWSCD4R_SCDT_MASK		0xff
/** @defgroup dfsdm_awscd4r_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chwdat4r CHWDAT4R CHWDAT4R
@{*/


#define DFSDM_CHWDAT4R_WDATA_SHIFT		0
#define DFSDM_CHWDAT4R_WDATA_MASK		0xffff
/** @defgroup dfsdm_chwdat4r_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chdatin4r CHDATIN4R CHDATIN4R
@{*/


#define DFSDM_CHDATIN4R_INDAT1_SHIFT		16
#define DFSDM_CHDATIN4R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_chdatin4r_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CHDATIN4R_INDAT0_SHIFT		0
#define DFSDM_CHDATIN4R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_chdatin4r_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg5r1 CHCFG5R1 CHCFG5R1
@{*/


#define DFSDM_CHCFG5R1_DATPACK_SHIFT		14
#define DFSDM_CHCFG5R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_chcfg5r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CHCFG5R1_DATMPX_SHIFT		12
#define DFSDM_CHCFG5R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_chcfg5r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CHCFG5R1_CHINSEL CHINSEL **/
#define DFSDM_CHCFG5R1_CHINSEL		(1 << 8)
/** DFSDM_CHCFG5R1_CHEN CHEN **/
#define DFSDM_CHCFG5R1_CHEN		(1 << 7)
/** DFSDM_CHCFG5R1_CKABEN CKABEN **/
#define DFSDM_CHCFG5R1_CKABEN		(1 << 6)
/** DFSDM_CHCFG5R1_SCDEN SCDEN **/
#define DFSDM_CHCFG5R1_SCDEN		(1 << 5)

#define DFSDM_CHCFG5R1_SPICKSEL_SHIFT		2
#define DFSDM_CHCFG5R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_chcfg5r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CHCFG5R1_SITP_SHIFT		0
#define DFSDM_CHCFG5R1_SITP_MASK		0x03
/** @defgroup dfsdm_chcfg5r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg5r2 CHCFG5R2 CHCFG5R2
@{*/


#define DFSDM_CHCFG5R2_OFFSET_SHIFT		8
#define DFSDM_CHCFG5R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_chcfg5r2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CHCFG5R2_DTRBS_SHIFT		3
#define DFSDM_CHCFG5R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_chcfg5r2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_awscd5r AWSCD5R AWSCD5R
@{*/


#define DFSDM_AWSCD5R_AWFORD_SHIFT		22
#define DFSDM_AWSCD5R_AWFORD_MASK		0x03
/** @defgroup dfsdm_awscd5r_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_AWSCD5R_AWFOSR_SHIFT		16
#define DFSDM_AWSCD5R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_awscd5r_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_AWSCD5R_BKSCD_SHIFT		12
#define DFSDM_AWSCD5R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_awscd5r_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_AWSCD5R_SCDT_SHIFT		0
#define DFSDM_AWSCD5R_SCDT_MASK		0xff
/** @defgroup dfsdm_awscd5r_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chwdat5r CHWDAT5R CHWDAT5R
@{*/


#define DFSDM_CHWDAT5R_WDATA_SHIFT		0
#define DFSDM_CHWDAT5R_WDATA_MASK		0xffff
/** @defgroup dfsdm_chwdat5r_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chdatin5r CHDATIN5R CHDATIN5R
@{*/


#define DFSDM_CHDATIN5R_INDAT1_SHIFT		16
#define DFSDM_CHDATIN5R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_chdatin5r_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CHDATIN5R_INDAT0_SHIFT		0
#define DFSDM_CHDATIN5R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_chdatin5r_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg6r1 CHCFG6R1 CHCFG6R1
@{*/


#define DFSDM_CHCFG6R1_DATPACK_SHIFT		14
#define DFSDM_CHCFG6R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_chcfg6r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CHCFG6R1_DATMPX_SHIFT		12
#define DFSDM_CHCFG6R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_chcfg6r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CHCFG6R1_CHINSEL CHINSEL **/
#define DFSDM_CHCFG6R1_CHINSEL		(1 << 8)
/** DFSDM_CHCFG6R1_CHEN CHEN **/
#define DFSDM_CHCFG6R1_CHEN		(1 << 7)
/** DFSDM_CHCFG6R1_CKABEN CKABEN **/
#define DFSDM_CHCFG6R1_CKABEN		(1 << 6)
/** DFSDM_CHCFG6R1_SCDEN SCDEN **/
#define DFSDM_CHCFG6R1_SCDEN		(1 << 5)

#define DFSDM_CHCFG6R1_SPICKSEL_SHIFT		2
#define DFSDM_CHCFG6R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_chcfg6r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CHCFG6R1_SITP_SHIFT		0
#define DFSDM_CHCFG6R1_SITP_MASK		0x03
/** @defgroup dfsdm_chcfg6r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg6r2 CHCFG6R2 CHCFG6R2
@{*/


#define DFSDM_CHCFG6R2_OFFSET_SHIFT		8
#define DFSDM_CHCFG6R2_OFFSET_MASK		0xffffff
/** @defgroup dfsdm_chcfg6r2_offset OFFSET OFFSET
@{*/
/**@}*/


#define DFSDM_CHCFG6R2_DTRBS_SHIFT		3
#define DFSDM_CHCFG6R2_DTRBS_MASK		0x1f
/** @defgroup dfsdm_chcfg6r2_dtrbs DTRBS DTRBS
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_awscd6r AWSCD6R AWSCD6R
@{*/


#define DFSDM_AWSCD6R_AWFORD_SHIFT		22
#define DFSDM_AWSCD6R_AWFORD_MASK		0x03
/** @defgroup dfsdm_awscd6r_awford AWFORD AWFORD
@{*/
/**@}*/


#define DFSDM_AWSCD6R_AWFOSR_SHIFT		16
#define DFSDM_AWSCD6R_AWFOSR_MASK		0x1f
/** @defgroup dfsdm_awscd6r_awfosr AWFOSR AWFOSR
@{*/
/**@}*/


#define DFSDM_AWSCD6R_BKSCD_SHIFT		12
#define DFSDM_AWSCD6R_BKSCD_MASK		0x0f
/** @defgroup dfsdm_awscd6r_bkscd BKSCD BKSCD
@{*/
/**@}*/


#define DFSDM_AWSCD6R_SCDT_SHIFT		0
#define DFSDM_AWSCD6R_SCDT_MASK		0xff
/** @defgroup dfsdm_awscd6r_scdt SCDT SCDT
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chwdat6r CHWDAT6R CHWDAT6R
@{*/


#define DFSDM_CHWDAT6R_WDATA_SHIFT		0
#define DFSDM_CHWDAT6R_WDATA_MASK		0xffff
/** @defgroup dfsdm_chwdat6r_wdata WDATA WDATA
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chdatin6r CHDATIN6R CHDATIN6R
@{*/


#define DFSDM_CHDATIN6R_INDAT1_SHIFT		16
#define DFSDM_CHDATIN6R_INDAT1_MASK		0xffff
/** @defgroup dfsdm_chdatin6r_indat1 INDAT1 INDAT1
@{*/
/**@}*/


#define DFSDM_CHDATIN6R_INDAT0_SHIFT		0
#define DFSDM_CHDATIN6R_INDAT0_MASK		0xffff
/** @defgroup dfsdm_chdatin6r_indat0 INDAT0 INDAT0
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_chcfg7r1 CHCFG7R1 CHCFG7R1
@{*/


#define DFSDM_CHCFG7R1_DATPACK_SHIFT		14
#define DFSDM_CHCFG7R1_DATPACK_MASK		0x03
/** @defgroup dfsdm_chcfg7r1_datpack DATPACK DATPACK
@{*/
/**@}*/


#define DFSDM_CHCFG7R1_DATMPX_SHIFT		12
#define DFSDM_CHCFG7R1_DATMPX_MASK		0x03
/** @defgroup dfsdm_chcfg7r1_datmpx DATMPX DATMPX
@{*/
/**@}*/

/** DFSDM_CHCFG7R1_CHINSEL CHINSEL **/
#define DFSDM_CHCFG7R1_CHINSEL		(1 << 8)
/** DFSDM_CHCFG7R1_CHEN CHEN **/
#define DFSDM_CHCFG7R1_CHEN		(1 << 7)
/** DFSDM_CHCFG7R1_CKABEN CKABEN **/
#define DFSDM_CHCFG7R1_CKABEN		(1 << 6)
/** DFSDM_CHCFG7R1_SCDEN SCDEN **/
#define DFSDM_CHCFG7R1_SCDEN		(1 << 5)

#define DFSDM_CHCFG7R1_SPICKSEL_SHIFT		2
#define DFSDM_CHCFG7R1_SPICKSEL_MASK		0x03
/** @defgroup dfsdm_chcfg7r1_spicksel SPICKSEL SPICKSEL
@{*/
/**@}*/


#define DFSDM_CHCFG7R1_SITP_SHIFT		0
#define DFSDM_CHCFG7R1_SITP_MASK		0x03
/** @defgroup dfsdm_chcfg7r1_sitp SITP SITP
@{*/
/**@}*/


/**@}*/

