grevaillot/svd_tools/headers/STM32L4x1/dfsdm.h
/** @defgroup dfsdm_dfsdm3_awsr DFSDM3AWSR analog watchdog status register
@{*/


#define DFSDM_DFSDM3_AWSR_AWHTF_SHIFT		8
#define DFSDM_DFSDM3_AWSR_AWHTF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_awsr_awhtf AWHTF Analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_DFSDM3_AWSR_AWLTF_SHIFT		0
#define DFSDM_DFSDM3_AWSR_AWLTF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_awsr_awltf AWLTF Analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_awcfr DFSDM3AWCFR analog watchdog clear flag register
@{*/


#define DFSDM_DFSDM3_AWCFR_CLRAWHTF_SHIFT		8
#define DFSDM_DFSDM3_AWCFR_CLRAWHTF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_awcfr_clrawhtf CLRAWHTF Clear the analog watchdog high threshold flag
@{*/
/**@}*/


#define DFSDM_DFSDM3_AWCFR_CLRAWLTF_SHIFT		0
#define DFSDM_DFSDM3_AWCFR_CLRAWLTF_MASK		0xff
/** @defgroup dfsdm_dfsdm3_awcfr_clrawltf CLRAWLTF Clear the analog watchdog low threshold flag
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_exmax DFSDM3EXMAX Extremes detector maximum register
@{*/


#define DFSDM_DFSDM3_EXMAX_EXMAX_SHIFT		8
#define DFSDM_DFSDM3_EXMAX_EXMAX_MASK		0xffffff
/** @defgroup dfsdm_dfsdm3_exmax_exmax EXMAX Extremes detector maximum value
@{*/
/**@}*/


#define DFSDM_DFSDM3_EXMAX_EXMAXCH_SHIFT		0
#define DFSDM_DFSDM3_EXMAX_EXMAXCH_MASK		0x07
/** @defgroup dfsdm_dfsdm3_exmax_exmaxch EXMAXCH Extremes detector maximum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_exmin DFSDM3EXMIN Extremes detector minimum register
@{*/


#define DFSDM_DFSDM3_EXMIN_EXMIN_SHIFT		8
#define DFSDM_DFSDM3_EXMIN_EXMIN_MASK		0xffffff
/** @defgroup dfsdm_dfsdm3_exmin_exmin EXMIN EXMIN
@{*/
/**@}*/


#define DFSDM_DFSDM3_EXMIN_EXMINCH_SHIFT		0
#define DFSDM_DFSDM3_EXMIN_EXMINCH_MASK		0x07
/** @defgroup dfsdm_dfsdm3_exmin_exminch EXMINCH Extremes detector minimum data channel
@{*/
/**@}*/


/**@}*/

/** @defgroup dfsdm_dfsdm3_cnvtimr DFSDM3CNVTIMR conversion timer register
@{*/


#define DFSDM_DFSDM3_CNVTIMR_CNVCNT_SHIFT		4
#define DFSDM_DFSDM3_CNVTIMR_CNVCNT_MASK		0xfffffff
/** @defgroup dfsdm_dfsdm3_cnvtimr_cnvcnt CNVCNT 28-bit timer counting conversion time t = CNVCNT[27:0] / fDFSDM_CKIN
@{*/
/**@}*/


/**@}*/
